[
  {
    "title": "Elderly Fall with Suspected Pelvic Fracture",
    "scenarioIntro": "🧠 **Teacher’s Points**: This case emphasizes gentle handling, strong scene awareness, and trauma suspicion in the elderly. Pelvic fractures are notoriously unstable—students must understand the hidden risk of retroperitoneal bleeding. Look for how they manage this quiet crisis: do they communicate clearly, stabilize effectively, and think through extrication options? It’s less about cool skills and more about thoughtful, patient-centered care. A good takeaway: 'Not all trauma is loud.'",
    "callInformation": {
      "type": "Trauma",
      "location": "Private residence – carpeted bedroom, second floor",
      "time": "08:15",
      "dispatchCode": "17-B-2",
      "dispatchNotes": [
        "84 y/o female fell overnight",
        "Caller unsure if patient lost consciousness",
        "Patient complaining of severe hip pain"
      ],
      "hazardsOrFlags": [
        "Cluttered bedroom",
        "Stairs to second floor"
      ],
      "crewNotes": "Patient is alert but unable to move. Daughter on scene."
    },
    "patientDemographics": {
      "name": "Margaret Bennett",
      "sex": "female",
      "age": 84,
      "height": "5'2\"",
      "weight": "105 lbs",
      "appearance": "Pale, frail, in obvious pain, unable to move lower limbs, lying supine beside the bed"
    },
    "patientPresentation": "Margaret is visibly distressed, clutching her lower abdomen and groaning with each movement attempt.",
    "incidentNarrative": "Margaret’s daughter called 911 after finding her mother on the bedroom floor. Margaret attempted to get to the bathroom overnight and lost her balance. She’s been lying there since early morning, alert but in pain.",
    "opqrst": {
      "onset": "30 minutes ago",
      "provocation": "Movement worsens the pain",
      "quality": "Sharp, aching",
      "radiation": "Pain radiates down both legs",
      "severity": "8/10",
      "time": "Constant since the fall"
    },
    "sampleHistory": {
      "signsSymptoms": "Pelvic pain, dizziness",
      "allergies": "None",
      "medications": "Ramipril (for blood pressure), ASA 81mg (preventative for cardiac risk)",
      "pastMedicalHistory": "Hypertension, osteopenia, prior fall",
      "lastOralIntake": "Tea and toast at 06:30",
      "eventsLeadingUp": "Dizzy on way to bathroom and fell"
    },
    "physicalExam": {
      "general": "Pale, anxious",
      "headNeck": "No trauma",
      "chest": "Clear bilaterally",
      "abdomen": "Tender over pelvis",
      "extremities": "External rotation, left leg short"
    },
    "vitalSigns": {
      "firstSet": {
        "HR": "104",
        "RR": "20",
        "BP": "92/60",
        "SpO2": "96%",
        "ETCO2": "38",
        "Temp": "36.4",
        "GCS": "15",
        "BGL": "5.2"
      },
      "secondSet": {
        "HR": "112",
        "RR": "24",
        "BP": "86/58",
        "SpO2": "95%",
        "ETCO2": "40",
        "Temp": "36.1",
        "GCS": "15",
        "BGL": "5.1"
      }
    },
 
    "caseProgression": {
      "withProperTreatment": "Patient remains stable and cooperative. Scene is controlled, scoop is used appropriately, and she is extricated gently with minimal further pain. Vitals remain relatively steady.",
      "withoutProperTreatment": "Patient becomes hypotensive and agitated if moved roughly. Incorrect lifting increases pain and risk. Poor scene control leads to delays or unsafe stair navigation."
    },
    "expectedTreatment": "BLS: Pelvic stabilization using scoop or improvised method, gentle handling, minimize movement. Transport rapidly. ALS: Monitor for hypotension, IV bolus, pain management if authorized.",
    "grsAnchors": {
      "sceneManagement": {
        "1": "Ignored scene hazards and failed to secure the environment before approaching Margaret.",
        "3": "Identified clutter but did not adjust approach or mitigate risks during scene entry.",
        "5": "Scoped and adapted to the cluttered scene, cleared a safe work area, and planned safe stair extrication.",
        "7": "Pre-planned stair navigation, repositioned environment safely, involved daughter without compromising care."
      },
      "patientAssessment": {
        "1": "Skipped structured trauma check. Missed signs of pelvic fracture.",
        "3": "Identified pain but missed key signs like leg shortening or instability.",
        "5": "Performed full trauma assessment. Identified pelvic pain and leg discrepancy.",
        "7": "Integrated MOI with presentation. Verbally suspected pelvic fracture early and adjusted exam approach accordingly."
      },
      "historyGathering": {
        "1": "No SAMPLE taken. Did not ask daughter for details.",
        "3": "Got some history, but missed key timing or medication details.",
        "5": "Complete SAMPLE taken. Confirmed medication use, fall timeline, and relevant medical history.",
        "7": "Engaged daughter empathetically, extracted clear timeline, and used history to direct decision making."
      },
      "decisionMaking": {
        "1": "Moved patient without stabilization or rationale.",
        "3": "Debated movement, but failed to act decisively or with rationale.",
        "5": "Chose scoop stretcher with pelvic precautions. Explained movement plan.",
        "7": "Balanced SMR, pelvic trauma risk, and frailty in a thoughtful and well-reasoned plan."
      },
      "proceduralSkill": {
        "1": "Movement was unsafe, painful, or disorganized.",
        "3": "Movement achieved but lacked coordination or clear communication.",
        "5": "Gentle, deliberate movement with stabilization. Clear crew coordination.",
        "7": "Directed movement with precision and control. Adapted scoop and stair chair usage smoothly."
      },
      "resourceUtilization": {
        "1": "Failed to use team, tools, or scene effectively.",
        "3": "Used some equipment, but poorly timed or executed.",
        "5": "Appropriate use of scoop, stair chair, and partner. Scene managed efficiently.",
        "7": "Thoughtfully involved all scene resources and preloaded stair strategy for seamless transition."
      },
      "communication": {
        "1": "Dismissive or abrupt with patient and daughter.",
        "3": "Basic explanation given but missed emotional needs.",
        "5": "Calm, professional, patient-focused language throughout.",
        "7": "Used clear, plain language. Validated daughter’s concerns and de-escalated emotional tension."
      }
    },
    "selfReflectiveJournaling": [
      "What clues helped me suspect a pelvic fracture?",
      "Did my extrication plan minimize movement and pain?",
      "How did I involve the family while maintaining control?",
      "What role did environment play in the safety of care?"
    ],
    "vocationalLearningOutcomes": [
      "VLO 1: Communicate effectively and compassionately with patients and families",
      "VLO 3: Apply assessment and critical thinking",
      "VLO 5: Perform patient care procedures per standards"
    ],
    "learningObjectives": [
      "Thorough geriatric trauma assessment",
      "Pelvic fracture recognition and stabilization",
      "Safe packaging and stairwell extrication"
    ],
    "modifiersUsed": []
  }
]
{
  "title": "Toddler Seizure After Fever Spikes at Daycare",
  "scenarioIntro": "🧠 **Teacher’s Points**: Pediatric calls are tough — not because they’re complicated, but because they’re emotionally loud. This one tests your ability to calm the room, scan for danger, and act deliberately. Students often panic at the sight of seizing kids. We want them to remember: protect the airway, observe carefully, gather history from rattled caregivers, and avoid unnecessary interventions. Don’t get sucked into chaos — become the calm center of the storm.",
  "callInformation": {
    "type": "Neurological (Seizure)",
    "location": "Daycare facility — bright and noisy playroom",
    "time": "10:12",
    "dispatchCode": "12-C-1",
    "dispatchNotes": [
      "18-month-old actively seizing",
      "Staff reports fever and sudden collapse",
      "Seizure ongoing for 3 minutes"
    ],
    "hazardsOrFlags": [
      "Loud, chaotic scene with children",
      "Panicked daycare staff"
    ],
    "crewNotes": "Staff already attempted to cool child with damp cloths. Seizure resolving on arrival."
  },
  "patientDemographics": {
    "name": "Olivia Chen",
    "sex": "female",
    "age": 1.5,
    "height": "75 cm",
    "weight": "11 kg",
    "appearance": "Postictal, warm to touch, being held by a panicked daycare worker"
  },
  "patientPresentation": "Olivia is limp, drowsy, breathing shallow but regular. She cries weakly when stimulated but quickly tires.",
  "incidentNarrative": "Daycare staff report Olivia was playing normally when she began crying, became unresponsive, and seized for approximately 2–3 minutes. She had a mild fever earlier in the week but no recent seizures or known health issues.",
  "opqrst": {
    "onset": "Sudden",
    "provocation": "None observed",
    "quality": "Tonic-clonic movement",
    "radiation": "Full body",
    "severity": "N/A",
    "time": "Lasted ~3 minutes, now postictal"
  },
  "sampleHistory": {
    "signsSymptoms": "Fever, seizure",
    "allergies": "None known",
    "medications": "Acetaminophen PRN",
    "pastMedicalHistory": "Normal development, no seizures prior",
    "lastOralIntake": "Milk at 08:30",
    "eventsLeadingUp": "Was warm this morning, no medication given yet"
  },
  "physicalExam": {
    "general": "Floppy but responsive to pain, flushed skin",
    "headNeck": "Fontanelle flat, no trauma",
    "chest": "Clear",
    "abdomen": "Soft, non-tender",
    "extremities": "Moves all limbs weakly"
  },
  "vitalSigns": {
    "firstSet": {
      "HR": "162",
      "RR": "32",
      "BP": "Not taken",
      "SpO2": "97%",
      "ETCO2": "N/A",
      "Temp": "39.1",
      "GCS": "10 (E3 V2 M5)",
      "BGL": "6.1"
    },
    "secondSet": {
      "HR": "148",
      "RR": "28",
      "BP": "90/54",
      "SpO2": "98%",
      "ETCO2": "N/A",
      "Temp": "38.6",
      "GCS": "12 (E4 V3 M5)",
      "BGL": "6.3"
    }
  },

  "caseProgression": {
    "withProperTreatment": "Olivia slowly regains alertness. Temp decreases with passive cooling. Staff reassured. Transport is smooth with vitals improving slightly.",
    "withoutProperTreatment": "Increased agitation from staff delays transport. Patient becomes more irritable or lethargic. No history is obtained. Unsafe handling or unnecessary interventions cause distress."
  },
  "expectedTreatment": "BLS: Protect airway during seizure, passive cooling, transport. ALS: Monitor vitals, possible medication if seizure prolonged. No glucose needed if normoglycemic and GCS improving.",
  "grsAnchors": {
    "sceneManagement": {
      "1": "Failed to control scene. Chaos worsened.",
      "3": "Eventually took control, but tension remained high.",
      "5": "Calmed scene quickly, assigned roles, cleared space for patient care.",
      "7": "Managed environment and emotional tone. Anticipated needs and led with clarity."
    },
    "patientAssessment": {
      "1": "Skipped primary. Missed GCS or temp.",
      "3": "Incomplete assessment. Missed signs of postictal state.",
      "5": "Full head-to-toe peds exam. GCS tracked. Temp and BGL done.",
      "7": "Fluid, confident peds exam. Tracked GCS trends. Connected vitals to febrile seizure logic."
    },
    "historyGathering": {
      "1": "No history obtained. Ignored staff.",
      "3": "Rushed SAMPLE with errors.",
      "5": "Clear SAMPLE from daycare staff. Asked follow-ups.",
      "7": "Engaged caregivers skillfully, used history to rule out complex causes."
    },
    "decisionMaking": {
      "1": "Uncoordinated, unsure what to do.",
      "3": "Followed protocol but lacked rationale.",
      "5": "Knew seizure likely febrile. Avoided unnecessary interventions.",
      "7": "Integrated history, vitals, and environment into a clear, reasoned decision tree."
    },
    "proceduralSkill": {
      "1": "Rough handling, unnecessary O₂ or IV.",
      "3": "Basic procedures done awkwardly.",
      "5": "Good BVM technique. Passive cooling used properly.",
      "7": "Used procedures judiciously. Calm hands, right interventions, minimal fuss."
    },
    "resourceUtilization": {
      "1": "Ignored partner and staff.",
      "3": "Involved others but poorly coordinated.",
      "5": "Used partner well. Staff included when appropriate.",
      "7": "Anticipated needs, delegated roles. Crew worked as a team."
    },
    "communication": {
      "1": "Cold or chaotic. Made staff more anxious.",
      "3": "Gave some info but not reassuring.",
      "5": "Clear, age-appropriate, confident with staff.",
      "7": "Reframed panic into clarity. Spoke with care and composure."
    }
  },
  "selfReflectiveJournaling": [
    "How did I balance speed with thoroughness?",
    "What helped me control the emotional tone of the scene?",
    "Did I rule out other causes of seizure beyond fever?",
    "How did I handle communication with non-parent caregivers?"
  ],
  "vocationalLearningOutcomes": [
    "VLO 1: Demonstrate effective pediatric care in high-stress situations",
    "VLO 3: Apply clinical reasoning to neurological emergencies",
    "VLO 5: Use communication and scene control strategies"
  ],
  "learningObjectives": [
    "Recognize and manage febrile seizures",
    "Communicate effectively in a pediatric setting",
    "Apply appropriate assessment techniques to a postictal child"
  ],
  "modifiersUsed": []
}
{
  "title": "Slurring, Sick, and Smells Like Fruit: DKA at the Gas Station",
  "scenarioIntro": "🧠 **Teacher’s Points**: This is a classic DKA — but only if you connect the dots. If you’re distracted by the slurred speech and vomiting, you might chase a stroke or food poisoning. The key teaching here is pattern recognition *plus* restraint. The vitals, the smell, the meds list — they all whisper 'DKA' if you’re listening. Don’t just chase symptoms — step back, scan for the story, and let the pathophysiology tell you what’s wrong.",
  "callInformation": {
    "type": "Medical — Altered LOC",
    "location": "Convenience store parking lot, urban setting",
    "time": "18:40",
    "dispatchCode": "31-C-1",
    "dispatchNotes": [
      "Caller reports young male slurring speech and vomiting",
      "Possible intoxication or diabetic issue",
      "Patient leaning against a wall, confused"
    ],
    "hazardsOrFlags": [
      "Busy urban parking lot",
      "Bystanders assuming overdose"
    ],
    "crewNotes": "No needle marks seen. Wallet nearby shows diabetic alert card."
  },
  "patientDemographics": {
    "name": "Jordan Wells",
    "sex": "male",
    "age": 24,
    "height": "5'10\"",
    "weight": "160 lbs",
    "appearance": "Sweaty, breathing rapidly, confused, sitting on curb with legs stretched out"
  },
  "patientPresentation": "Jordan is alert but disoriented, answers slowly, slurred speech. His breath has a fruity odor. He appears exhausted, complains of abdominal pain, and vomited twice before your arrival.",
  "incidentNarrative": "Jordan left work early feeling nauseous and lightheaded. He didn’t take his insulin today, saying he hadn’t eaten much. He started vomiting mid-afternoon and came to the store to get Gatorade before sitting down and collapsing.",
  "opqrst": {
    "onset": "Progressively worse over the day",
    "provocation": "Movement worsens nausea",
    "quality": "Abdominal pain, general malaise",
    "radiation": "No radiation",
    "severity": "Moderate to severe discomfort",
    "time": "Began around noon, worsening since"
  },
  "sampleHistory": {
    "signsSymptoms": "Nausea, vomiting, fatigue, fruity breath",
    "allergies": "None known",
    "medications": "Insulin (long-acting, short-acting)",
    "pastMedicalHistory": "Type 1 diabetes since age 10",
    "lastOralIntake": "Half a granola bar, ~7am",
    "eventsLeadingUp": "Skipped insulin dose due to low appetite; developed worsening symptoms"
  },
  "physicalExam": {
    "general": "Sick-looking, alert but slow to respond",
    "headNeck": "No trauma, PERRL",
    "chest": "Rapid, deep respirations (Kussmaul)",
    "abdomen": "Mild tenderness, soft",
    "extremities": "Cool, no edema"
  },
  "vitalSigns": {
    "firstSet": {
      "HR": "118",
      "RR": "28",
      "BP": "102/66",
      "SpO2": "97%",
      "ETCO2": "22 mmHg",
      "Temp": "37.0",
      "GCS": "14 (E4 V4 M6)",
      "BGL": "25.3 mmol/L"
    },
    "secondSet": {
      "HR": "124",
      "RR": "30",
      "BP": "98/60",
      "SpO2": "96%",
      "ETCO2": "20 mmHg",
      "Temp": "37.3",
      "GCS": "13 (E4 V3 M6)",
      "BGL": "24.7 mmol/L"
    }
  },
 
  "caseProgression": {
    "withProperTreatment": "Patient remains stable, responsive. ETCO₂ trend and BGL recognized as DKA indicators. Transport initiated promptly with supportive care. ALS consulted early.",
    "withoutProperTreatment": "Patient vomits again, becomes more lethargic. Crew mistakenly treats for hypoglycemia, worsening confusion. ETCO₂ ignored. Delayed transport leads to deterioration en route."
  },
  "expectedTreatment": "BLS: High suspicion of DKA, no glucose given due to high BGL. Monitor vitals, O₂ only if SpO₂ < 94%, position of comfort, prepare for ALS backup. ALS: IV fluids if in scope, early hospital notification.",
  "grsAnchors": {
    "sceneManagement": {
      "1": "Ignored bystanders, failed to assess safety. No public shielding.",
      "3": "Scene safe but didn't engage with confused public. Delayed start.",
      "5": "Managed public perception, created a private working space.",
      "7": "Turned chaotic scene into a learning opportunity for bystanders. Calm, respectful authority."
    },
    "patientAssessment": {
      "1": "No ETCO₂, no BGL, missed fruity breath.",
      "3": "Vitals and BGL done, but missed key cues like Kussmaul breathing.",
      "5": "Identified abnormal vitals, Kussmaul pattern, and used ETCO₂.",
      "7": "Tied ETCO₂ + Kussmaul to acid-base status. Used assessment to shape narrative, not checklist."
    },
    "historyGathering": {
      "1": "No history obtained.",
      "3": "Rushed SAMPLE with confusion from patient.",
      "5": "Got solid SAMPLE, used diabetic card to verify background.",
      "7": "Used questions to uncover missed insulin, poor intake, and DKA triggers."
    },
    "decisionMaking": {
      "1": "Assumed overdose, gave glucose reflexively.",
      "3": "Unsure what to do with high BGL.",
      "5": "Recognized DKA based on pattern. Avoided glucose. Early transport.",
      "7": "Anticipated deterioration. Made hospital contact. Planned for ALS escalation."
    },
    "proceduralSkill": {
      "1": "Poor technique, misread monitor.",
      "3": "BGL taken, but fumbled with monitor or ETCO₂.",
      "5": "Clean BGL, ETCO₂, vitals. No unnecessary O₂.",
      "7": "Confident, efficient, no wasted motion. Skills used only when appropriate."
    },
    "resourceUtilization": {
      "1": "Worked alone, partner idle.",
      "3": "Used partner but not proactively.",
      "5": "Partner assigned clear tasks. Teamwork evident.",
      "7": "Delegated like a leader. Called for ALS early. Briefed team continuously."
    },
    "communication": {
      "1": "Dismissive or vague. Confused patient further.",
      "3": "Gave basic info, didn’t explain rationale.",
      "5": "Spoke clearly. Explained working diagnosis. Reassured patient.",
      "7": "Taught the patient about DKA during transport. Built trust through transparency and tone."
    }
  },
  "selfReflectiveJournaling": [
    "Did I recognize the red flags of DKA early enough?",
    "What role did ETCO₂ and respiratory pattern play in my clinical reasoning?",
    "How confident was I in *not* treating with glucose?",
    "How did I ensure I wasn’t biased by bystander assumptions (e.g., 'he’s just high')?"
  ],
  "vocationalLearningOutcomes": [
    "VLO 2: Apply patient assessment findings to complex medical conditions",
    "VLO 3: Integrate diagnostic data into clinical decision-making",
    "VLO 6: Demonstrate leadership and team communication in emergency care"
  ],
  "learningObjectives": [
    "Identify signs of diabetic ketoacidosis in the prehospital setting",
    "Use ETCO₂ trends to guide differential thinking",
    "Avoid common treatment errors in altered diabetic patients"
  ],
  "modifiersUsed": []
}
